In [1]:
import pandas as pd

In [2]:
import numpy as np

In [4]:
file_path = r"c:\Users\HP\Downloads\AdventureWorks_Customers.csv"
df = pd.read_csv(file_path, encoding="ISO-8859-1")

In [31]:
df.info

<bound method DataFrame.info of        CustomerKey Prefix  FirstName LastName   BirthDate MaritalStatus  \
0            11000    MR.        JON     YANG  04/08/1966             M
1            11001    MR.     EUGENE    HUANG   5/14/1965             S
2            11002    MR.      RUBEN   TORRES  08/12/1965             M
3            11003    MS.    CHRISTY      ZHU   2/15/1968             S
4            11004   MRS.  ELIZABETH  JOHNSON  08/08/1968             S
...            ...    ...        ...      ...         ...           ...
18143        29479    MR.      TOMMY     TANG  07/04/1958             M
18144        29480   MRS.       NINA     RAJI  11/10/1960             S
18145        29481    MR.       IVAN     SURI  01/05/1960             S
18146        29482    MR.    CLAYTON    ZHANG  03/05/1959             M
18147        29483    MR.      JÉSUS  NAVARRO  12/08/1959             M

      Gender                    EmailAddress AnnualIncome  TotalChildren  \
0          M       jon24@adventure-works.com     $90,000               2
1          M    eugene10@adventure-works.com     $60,000               3
2          M     ruben35@adventure-works.com     $60,000               3
3          F   christy12@adventure-works.com     $70,000               0
4          F  elizabeth5@adventure-works.com     $80,000               5
...      ...                             ...          ...            ...
18143      M      tommy2@adventure-works.com     $30,000               1
18144      F      nina21@adventure-works.com     $30,000               3
18145      M       ivan0@adventure-works.com     $30,000               3
18146      M    clayton0@adventure-works.com     $30,000               3
18147      M      jésus9@adventure-works.com     $30,000               0

        EducationLevel    Occupation HomeOwner
0            Bachelors  Professional         Y
1            Bachelors  Professional         N
2            Bachelors  Professional         Y
3            Bachelors  Professional         N
4            Bachelors  Professional         Y
...                ...           ...       ...
18143  Graduate Degree      Clerical         Y
18144  Graduate Degree      Clerical         Y
18145  Graduate Degree      Clerical         N
18146        Bachelors      Clerical         Y
18147        Bachelors      Clerical         Y

[18148 rows x 13 columns]>

In [32]:
print(df.head())

   CustomerKey Prefix  FirstName LastName   BirthDate MaritalStatus Gender  \
0        11000    MR.        JON     YANG  04/08/1966             M      M
1        11001    MR.     EUGENE    HUANG   5/14/1965             S      M
2        11002    MR.      RUBEN   TORRES  08/12/1965             M      M
3        11003    MS.    CHRISTY      ZHU   2/15/1968             S      F
4        11004   MRS.  ELIZABETH  JOHNSON  08/08/1968             S      F

                     EmailAddress AnnualIncome  TotalChildren EducationLevel  \
0       jon24@adventure-works.com     $90,000               2      Bachelors
1    eugene10@adventure-works.com     $60,000               3      Bachelors
2     ruben35@adventure-works.com     $60,000               3      Bachelors
3   christy12@adventure-works.com     $70,000               0      Bachelors
4  elizabeth5@adventure-works.com     $80,000               5      Bachelors

     Occupation HomeOwner
0  Professional         Y
1  Professional         N
2  Professional         Y
3  Professional         N
4  Professional         Y

In [7]:
import matplotlib.pyplot as plt
import seaborn as sns

In [11]:
df[['EducationLevel']].describe()

       EducationLevel
count           18148
unique              5
top         Bachelors
freq             5261

In [21]:
print(df.columns)

Index(['CustomerKey', 'Prefix', 'FirstName', 'LastName', 'BirthDate',
       'MaritalStatus', 'Gender', 'EmailAddress', 'AnnualIncome',
       'TotalChildren', 'EducationLevel', 'Occupation', 'HomeOwner'],
      dtype='object')

In [26]:
df.dropna(how='all')

,CustomerKey,Prefix,FirstName,LastName,BirthDate,MaritalStatus,Gender,EmailAddress,AnnualIncome,TotalChildren,EducationLevel,Occupation,HomeOwner
0,11000,MR.,JON,YANG,04/08/1966,M,M,jon24@adventure-works.com,"$90,000",2,Bachelors,Professional,Y
1,11001,MR.,EUGENE,HUANG,5/14/1965,S,M,eugene10@adventure-works.com,"$60,000",3,Bachelors,Professional,N
2,11002,MR.,RUBEN,TORRES,08/12/1965,M,M,ruben35@adventure-works.com,"$60,000",3,Bachelors,Professional,Y
3,11003,MS.,CHRISTY,ZHU,2/15/1968,S,F,christy12@adventure-works.com,"$70,000",0,Bachelors,Professional,N
4,11004,MRS.,ELIZABETH,JOHNSON,08/08/1968,S,F,elizabeth5@adventure-works.com,"$80,000",5,Bachelors,Professional,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
18143,29479,MR.,TOMMY,TANG,07/04/1958,M,M,tommy2@adventure-works.com,"$30,000",1,Graduate Degree,Clerical,Y
18144,29480,MRS.,NINA,RAJI,11/10/1960,S,F,nina21@adventure-works.com,"$30,000",3,Graduate Degree,Clerical,Y
18145,29481,MR.,IVAN,SURI,01/05/1960,S,M,ivan0@adventure-works.com,"$30,000",3,Graduate Degree,Clerical,N
18146,29482,MR.,CLAYTON,ZHANG,03/05/1959,M,M,clayton0@adventure-works.com,"$30,000",3,Bachelors,Clerical,Y
18147,29483,MR.,JÉSUS,NAVARRO,12/08/1959,M,M,jésus9@adventure-works.com,"$30,000",0,Bachelors,Clerical,Y

In [33]:
df['FirstName']==True #عملت تصفيه للداتا

0        False
1        False
2        False
3        False
4        False
         ...
18143    False
18144    False
18145    False
18146    False
18147    False
Name: FirstName, Length: 18148, dtype: bool

In [ ]:
df['AnnualIncome'] = pd.to_numeric(df['AnnualIncome'], errors='coerce')  #حولت الداتا بتاعت AnnualIncome لى Numaric

In [41]:
 df[(df['EducationLevel'] == 'Graduate Degree') & (df['AnnualIncome'] >= 50000)]

Empty DataFrame
Columns: [CustomerKey, Prefix, FirstName, LastName, BirthDate, MaritalStatus, Gender, EmailAddress, AnnualIncome, TotalChildren, EducationLevel, Occupation, HomeOwner]
Index: []

In [49]:
print(df.AnnualIncome)

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
         ..
18143   NaN
18144   NaN
18145   NaN
18146   NaN
18147   NaN
Name: AnnualIncome, Length: 18148, dtype: float64